app/controllers/searches_controller.rb

SELECT `searches`.* FROM `searches`
---
  def index
    @search = Search.search(params[:q])

INSERT INTO `searches` (`created_at`, `updated_at`) VALUES ('2015-05-08 15:29:04', '2015-05-08 15:29:04')
---
  def create
    @search = Search.new(search_params)

    respond_to do |format|
      if @search.save

SELECT  `searches`.* FROM `searches` WHERE `searches`.`id` = 1 LIMIT 1
---
    def set_search
      @search = Search.find(params[:id])