app/controllers/user_informations_controller.rb

  def index
    @user_informations = UserInformation.all
---
SELECT `user_informations`.* FROM `user_informations`