app/controllers/welcomes_controller.rb

  def index
    @welcomes = Welcome.all
---
SELECT `welcomes`.* FROM `welcomes`

  def create
    @welcome = Welcome.new(welcome_params)

    respond_to do |format|
      if @welcome.save
---
INSERT INTO `welcomes` (`created_at`, `updated_at`) VALUES ('2015-05-05 19:30:26', '2015-05-05 19:30:26')

  def destroy
    @welcome.destroy
---
DELETE FROM `welcomes` WHERE `welcomes`.`id` = 1

    def set_welcome
      @welcome = Welcome.find(params[:id])
---
SELECT  `welcomes`.* FROM `welcomes` WHERE `welcomes`.`id` = 1 LIMIT 1